In [9]:
import pandas as pd
import numpy as np

In [10]:
dates=pd.date_range("20210101",periods=6)
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=['a','b','c','d'])
df

                   a         b         c         d
2021-01-01  0.541175  1.018385  0.370833 -0.615326
2021-01-02 -0.451953 -0.573988  1.382935 -0.120240
2021-01-03  0.791841 -0.174764 -0.035185  0.524474
2021-01-04 -0.275955 -2.091906  0.992510  1.382408
2021-01-05  0.150982 -0.928905 -0.664206 -0.328744
2021-01-06  1.026350  0.829721  0.686656 -1.774101

In [11]:
name=['ali','sara','dana','dara']
name

['ali', 'sara', 'dana', 'dara']

In [13]:
np.random.randn(4,4)

array([[-0.48093094,  0.97862491,  0.71188175, -0.17846896],
       [ 0.04402313,  1.66727758,  0.07675552,  1.11235407],
       [-1.38233747,  0.93268973,  1.7326457 ,  1.12483794],
       [-0.00291113, -1.6785747 , -0.18830875, -0.56018887]])

In [16]:
df=pd.DataFrame(np.random.randn(4,4))

In [29]:
data = np.random.randint(5,20,size=(4))
df = pd.DataFrame(data, columns=['random_numbers'])

print(df)

   random_numbers
0              19
1               9
2              17
3               5

In [35]:
name=['ali','sara','dana','dara']
data = np.random.randint(5,20,size=(4,3))
df = pd.DataFrame(data,index=name ,columns=['math', 'history', 'physics'])

print(df)

      math  history  physics
ali      5       11       14
sara     6        9        5
dana    19       10       11
dara    12        5       10

In [36]:
name=['ali','sara','dana','dara']
column=['math', 'history', 'physics']
data = np.random.randint(5,20,size=(4,3))
df = pd.DataFrame(data,index=name ,columns=column)

print(df)

      math  history  physics
ali     19       13       12
sara     7       16       15
dana    12        5       11
dara    17       15       18

In [37]:
df.describe()

            math   history    physics
count   4.000000   4.00000   4.000000
mean   13.750000  12.25000  14.000000
std     5.377422   4.99166   3.162278
min     7.000000   5.00000  11.000000
25%    10.750000  11.00000  11.750000
50%    14.500000  14.00000  13.500000
75%    17.500000  15.25000  15.750000
max    19.000000  16.00000  18.000000

In [43]:
df.math.mean()

13.75

In [44]:
df.mean()

math       13.75
history    12.25
physics    14.00
dtype: float64

In [45]:
df["math"].mean()

13.75

In [46]:
df.to_csv('downloads/my-file.csv')

In [47]:
df.to_excel('downloads/my-file.xlsx')

In [51]:
ss=pd.read_csv('downloads/my-file.csv')

In [52]:
ss

  Unnamed: 0  math  history  physics
0        ali    19       13       12
1       sara     7       16       15
2       dana    12        5       11
3       dara    17       15       18

In [63]:
#a=np.array(4,3)
a=np.array([[19,13,12],[7,16,15],[12,5,11],[17,15,18]])

In [64]:
a

array([[19, 13, 12],
       [ 7, 16, 15],
       [12,  5, 11],
       [17, 15, 18]])

In [61]:
a.shape()

TypeError: 'tuple' object is not callable

In [6]:
import pandas as pd
import numpy as np
name=['ali','sara','dana','dara']
column=['math', 'history', 'physics']
data = np.array([[19,13,12],[7,16,15],[12,5,11],[17,15,18]])
df = pd.DataFrame(data,index=name ,columns=column)

In [7]:
df

      math  history  physics
ali     19       13       12
sara     7       16       15
dana    12        5       11
dara    17       15       18